'''
从键盘输入n (n<10), 输出九九乘法表的前n行的结果

n=7
1*1=1   1*2=2   1*3=3   1*4=4   1*5=5   1*6=6   1*7=7   
        2*2=4   2*3=6   2*4=8   2*5=10  2*6=12  2*7=14  
                3*3=9   3*4=12  3*5=15  3*6=18  3*7=21  
                        4*4=16  4*5=20  4*6=24  4*7=28  
                                5*5=25  5*6=30  5*7=35  
                                        6*6=36  6*7=42  
                                                7*7=49

'''
s=input("n=")
if not s.isdigit():
    print("输入错误")
else:
    n=int(s)
    for i in range(1,n+1):
        print(" "*8*(i-1),end="")      #显示每行前面的空位
        for j in range(i,n+1):         #显示第i行上的所有乘积式
            print("%-8s"%(str(i)+"*"+str(j)+"="+str(i*j)),end="")  #显示第j列一个乘积式
        print()
