'''
幸运数对求解问题。若两个数相差3, 且它们各自的各位数字之和均能被6整除, 则称这两个数
为一组幸运数对, 例如147与150就是一组幸运数对。已知函数xys(a)用于判断a与a+3
是否为一组幸运数对，试求所有的三位幸运数对,程序运行效果如下:

xys函数返回的值应该是布尔型(True/False)

三位幸运数对:
129 : 132
138 : 141
147 : 150
189 : 192
'''

def xys(a):
    # str(a): 把三位数a转译成字符类型，例如123-->'123'
    # list(a): 再把字符型的三位数转成列表, eg. '123' --> ['1', '2', '3']
    # map(): 把列表里面的每一个元素转成整型,返回一个map对象, eg. ['1', '2', '3'] --> map对象, 里面包含了[1, 2, 3]
    # list(map...): 将map对象转成列表, eg. map对象-->[1, 2, 3]
    # sum(....): 求和，将列表里面的所有元素求和, eg. 1+2+3=6
    sa=sum(list(map(int,list(str(a)))))       #求a的各位数字之和
    sb=sum(list(map(int,list(str(a+3)))))     #求a+3的各位数字之和
    return ((sa%6==0) and (sb%6==0))


print("三位幸运数对:")
for i in range(100,997): # i=100, 101, ..., 996
    if xys(i):
        print(i,":",i+3)
